In [3]:
import pandas as pd
import numpy as np

In [5]:
arr = np.random.randint(10,55, size=(4,4))

In [6]:
arr

array([[17, 28, 10, 34],
       [42, 51, 13, 28],
       [43, 47, 50, 14],
       [17, 54, 43, 17]])

In [14]:
dataframe1 = pd.DataFrame(data=arr, columns=['A', 'B', 'C', 'D'], index=[1,2,3,4])

In [15]:
dataframe1

    A   B   C   D
1  17  28  10  34
2  42  51  13  28
3  43  47  50  14
4  17  54  43  17

In [20]:
lista=[[10,20,30,40,50],[60,70,80,90,100],[110,120,130,140,150]]

In [30]:
dataframe2 = pd.DataFrame(data=lista, index=[1,2,3], columns = ['A', 'B', 'C', 'D', 'E'])

In [31]:
dataframe2

     A    B    C    D    E
1   10   20   30   40   50
2   60   70   80   90  100
3  110  120  130  140  150

In [44]:
dados = {'Produto':['Teclado', 'Mouse','Microfone','Monitor','Gabinete'], 'Preco de Venda':[150,100,200,700,250]}

In [45]:
dados

{'Produto': ['Teclado', 'Mouse', 'Microfone', 'Monitor', 'Gabinete'],
 'Preco de Venda': [150, 100, 200, 700, 250]}

In [46]:
dataframe3 = pd.DataFrame(data=dados)

In [47]:
dataframe3

     Produto  Preco de Venda
0    Teclado             150
1      Mouse             100
2  Microfone             200
3    Monitor             700
4   Gabinete             250

In [49]:
dataframe3['Custo'] = [100, 50, 150, 500, 200]

In [50]:
dataframe3

     Produto  Preco de Venda  Custo
0    Teclado             150    100
1      Mouse             100     50
2  Microfone             200    150
3    Monitor             700    500
4   Gabinete             250    200

In [51]:
dataframe3['Lucro'] = dataframe3['Preco de Venda'] - dataframe3['Custo']

In [52]:
dataframe3

     Produto  Preco de Venda  Custo  Lucro
0    Teclado             150    100     50
1      Mouse             100     50     50
2  Microfone             200    150     50
3    Monitor             700    500    200
4   Gabinete             250    200     50